import React from "react";

const Home = () => {
	return (
		<div className="flex flex-col items-center justify-center bg-neutral-00">
			<h1 dir="rtl" className="pt-2 xl:text-2xl text-center font-bold ">
				שלום וברוכים הבאים לאתר הקהילה של יו-גי-הו גואט פורמאט!
			</h1>
			<h3 dir="rtl" className="pt-2 text-md font-semibold">
				מזה יו-גי-הו?
			</h3>
			<p dir="rtl" className="text-sm ml-20 mr-20 text-center">
				יוגי-הו! היא סדרת אנימה יפנית המבוססת על מאנגה בשם זה העוסקת בעיקרה
				במשחק קלפים מיוחד. לה 5 עונות, 3 סרטי אנימה, והיא משודרת מאז שנת 2000
				ועד היום. בישראל, הסדרה שודרה לראשונה החל משנת 2003 בערוץ הילדים, גם סרט
				האנימה הראשון "יו-גי-הו! הסרט!" דובב ועלה לאקרנים בארץ ב-2004 (כולל קלף
				משחק פרומו מתנה עם כל כרטיס)
			</p>
			<p dir="rtl" className="text-sm ml-20 mr-20 text-center pt-3">
				כמו כן יו-גי-הו! הוא משחק איסוף קלפים (TCG) שפותח והוצא לאור על ידי
				החברה קונמי, שהשיקה אותו לראשונה בשנת 1999. הוא מבוסס על המשחק הבדיוני
				במנגה המקורית שיצר אומן הקומיקס קאזוקי טאקאהאשי, יו-גי-הו!, "קסם
				ומכשפים" (שלמעשה, זהו הרכיב העיקרי בעלילה שבאנימה המקורית של יו-גי-הו!),
				ובסיפורי אנימה חדשים יותר הוא נקרא "דו-קרב מפלצות" (שזה הרכיב העיקרי
				בסיפורים נוספים שיצרה החברה). חוקי המשחק זהים לחוקי המשחק המוצגים בסדרה,
				אלא שבשונה מחוקי המשחק שבסיפורי הקומיקס שלו, חוקי המשחק במשחק האמיתי הם
				קבועים ואינם משתנים. הוא נרשם בספר השיאים של גינס כמשחק ה"סחר בקלפים"
				(Trading Card Game) הנמכר ביותר בעולם ביולי 2009, עם מכירה של מעל 22
				מיליארד קלפים ברחבי העולם. משחק הקלפים עדיין שומר על פופולריות ברחבי
				העולם, בעיקר ביפן, צפון אמריקה, אירופה ואוסטרליה.
			</p>
			<h3 dir="rtl" className="pt-2 text-md font-semibold">
				מזה גואט פורמאט?
			</h3>
			<p dir={"rtl"} className="text-sm ml-20 mr-20 text-center pt-3">
				גואט הוא פורמט ששוחק בשנת 2005 ונחשב לאחד הפורמטים המעניינים והטובים בכל
				הזמנים. הוא משוחק עד היום בקהילות רבות, ולמרות שזה פורמט שלא משתנה, גם
				אחרי מעל 15 שנה הוא חי ומגוון יותר מאי פעם. השם Goat מפורש רבות
				כ-"greatest of all time" אך כלל הנראה לקוח מהקלף Scapegoat שהיה נפוץ
				מאוד ב2005. זה הפורמאט פשוט, זול ומגוון ביותר אשר שם דגש על משחק מוחות
				וגם קצת מזל (אמרנו אמונה בלב הקלפים?) עד 2022 לא הייתה הכרה רשמית
				בפורמאטי עבר, אילו מאז קונאמי מאפשרת לקיים טורנירי עבר במסגרת טורנירים
				שנקראים Time Wizard. מתקיימים בנוסף גם טורנירי אדיסון ואהט (של השנים
				2010, 2014).
			</p>
			<h3 dir="rtl" className="pt-2 text-md font-semibold">
				מה כיף כל כך במשחק?
			</h3>
			<p dir="rtl" className="text-sm ml-20 mr-20 text-center pt-3">
				גואט הוא פורמט איטי ומלא באינטראקציה בין 2 השחקנים. הקלפים והחוקים
				בפורמט פשוטים מאוד, ללא הרים של טקסט שבוחנים את הזיכרון. לכן, זה משחק
				מוחות מול היריב, ולא מול הקלפים. המשחק נמשך הרבה תורות, כשכל תור יחסית
				קצר. מצב זה נותן ליכולת והידע של שחקן לבוא לידי ביטוי. יש יותר הזדמנויות
				לעשות טעויות ולהעניש את היריבים על טעויות שלהם. ההבדלים בין דק מטא טיר 1
				לבין דקי רוג לא אופרסיביים כמו היום, וברוב המקרים לא מונעים מהשחקן
				המפסיד את היכולת לשחק מהתור הראשון. כלומר, יש יותר הזדמנות לשחק גם אם
				היריב בעמדה מנצחת, ואפילו להפוך את המשחק, בניגוד להרבה משחקים כיום.
				פורמט זה שם דגש רב על יכולות מסוימות שפחות באות לידי ביטוי היום -
				סבלנות, ניהול משאבים חכם, יתרון קלפים, קריאה נכונה של מה יש ליריב ולשחק
				סביב זה, בלאפים ועוד! זו חווית משחק שונה מאוד מהמשחק העדכני וכיף לשבור
				שגרה ולהתנסות. הפורמט ידידותי מאוד למתחילים, ובאותה מידה נותן אתגר
				ויכולת ביטוי ותחרותיות לותיקים. בניגוד לפורמאט הנוכחי לא צריך לקנות מפעם
				לפעם קלפים חדשים ולעקוב אחרי המטא. יש סה"כ 1700 קלפים ורק חלק קטן מהם
				נחשבים יקרים (זולים בהרבה לעומת הנוכחי).
			</p>
			<h3 dir="rtl" className="pt-2 text-md font-semibold">
				מי אנחנו?
			</h3>
			<p dir="rtl" className="text-sm ml-20 mr-20 text-center pt-3 pb-3">
				אנחנו הקהילה הלא רשמית של גואט פורמאט ישראל. למעשה תת קהילה מתוך קהילת
				היוגיהו הישראלית שמונה 1700 חברים. טורנירי יוגיהו עדכניים מתקיימים בכמה
				נקודות בארץ, ואחת לתקופה אליפות ארצית שמקנה השתתפות באליפות העולם.
			</p>
		</div>
	);
};

export default Home;
